
# YOLOv5  by Ultralytics, GPL-3.0 license

# Parameters
nc: 5  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [ 5,6,8,14,15,11 ]
  - [ 10,13, 16,30, 33,23 ]  # P3/8
  - [ 30,61, 62,45, 59,119 ]  # P4/16
  - [ 116,90, 156,198, 373,326 ]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Focus, [64, 3]],  # 0-P1/2
   [-1, 1, GhostConv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, BottleneckCSP, [128]],
   [-1, 1, GhostConv, [256, 3, 2]],  # 3-P3/8
   [-1, 9, BottleneckCSP, [256]],
   [-1, 1, GhostConv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, BottleneckCSP, [512]],
   [-1, 1, GhostConv, [1024, 3, 2]],  # 7-P5/32
   [-1, 1, SPP, [1024, [5, 9, 13]]],
   [-1, 3, BottleneckCSP, [1024, False]],  # 9
  ]

# YOLOv5 head
head:
  [ [ -1, 1, Conv, [ 512, 1, 1 ] ],          # 10
    [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],  # 11
    [ [ -1, 6 ], 1, Concat, [ 1 ] ],  # cat backbone P4 #12
    [ -1, 3, C3, [ 512, False ] ],  # 13

    [ -1, 1, Conv, [ 512, 1, 1 ] ], # 14
    [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ], # 15
    [ [ -1, 4 ], 1, Concat, [ 1 ] ],  # cat backbone P3 16
    [ -1, 3, C3, [ 512, False ] ],  # 17

    [ -1, 1, Conv, [ 256, 1, 1 ] ], # 18
    [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ], #19
    [ [ -1, 2 ], 1, Concat, [ 1 ] ],  # cat backbone P3 # 20
    [ -1, 3, C3, [ 256, False ] ],  # 21 (P3/8-small)  21

    [ -1, 1, Conv, [ 256, 3, 2 ] ],   #22
    [ [ -1, 18 ], 1, Concat, [ 1 ] ],  # cat backbone P3 # 23
    [ -1, 3, C3, [ 256, False ] ],  # 24 (P3/8-small)

    [ -1, 1, Conv, [ 256, 3, 2 ] ],
    [ [ -1, 14 ], 1, Concat, [ 1 ] ],  # cat head P4
    [ -1, 3, C3, [ 512, False ] ],  # 27 (P4/16-medium)

    [ -1, 1, Conv, [ 512, 3, 2 ] ],
    [ [ -1, 10 ], 1, Concat, [ 1 ] ],  # cat head P5
    [ -1, 3, C3, [ 1024, False ] ],  # 30 (P5/32-large)
    [ [ 21,24,27,30 ], 1, Detect, [ nc, anchors ] ],  # Detect(P3, P4, P5)
  ]


